CSI API ETABS v1
cPropFrame.SDShape Property
 Gives access to API calls related to Section Designer sections.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cPropFrameSDShape SDShape { get; }
ReadOnly Property SDShape As cPropFrameSDShape
	Get
Dim instance As cPropFrame
Dim value As cPropFrameSDShape
value = instance.SDShape
property cPropFrameSDShape^ SDShape {
	cPropFrameSDShape^ get ();
}
abstract SDShape : cPropFrameSDShape with get
Property Value
Type: cPropFrameSDShape
Return Value
Type: cPropFrameSDShape
Remarks
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace